Австралия/src/AccumulationRegisters/GoodsAwaitingCustomsClearance/GoodsAwaitingCustomsClearance.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>GoodsAwaitingCustomsClearance</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SupplierInvoice</name>
    <type>
      <types>DocumentRef.SupplierInvoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PurchaseOrder</name>
    <type>
      <types>DocumentRef.PurchaseOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>CatalogRef.ProductsBatches</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Catalogs/Products/Products.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Products</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccountingMethod</name>
    <type>
      <types>EnumRef.InventoryValuationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>BundleDisplayInPrintForms</name>
    <type>
      <types>EnumRef.ProductBundleDisplay</types>
    </type>
  </attributes>
  <attributes>
    <name>BundlePricingStrategy</name>
    <type>
      <types>EnumRef.ProductBundlePricingStrategy</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </attributes>
  <attributes>
    <name>Cell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ConversionRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CountryOfOrigin</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpensesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>GuaranteePeriod</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HSCode</name>
    <type>
      <types>CatalogRef.HSCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>InventoryGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>IsBundle</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsFreightService</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Manufacturer</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>MeasurementUnit</name>
    <type>
      <types>CatalogRef.UOMClassifier</types>
    </type>
  </attributes>
  <attributes>
    <name>OrderCompletionDeadline</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PictureFile</name>
    <type>
      <types>CatalogRef.ProductsAttachedFiles</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceGroup</name>
    <type>
      <types>CatalogRef.PriceGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>PricingBalanceMax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PricingBalanceMin</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProductCrossReference</name>
    <type>
      <types>CatalogRef.SuppliersProducts</types>
    </type>
  </attributes>
  <attributes>
    <name>UseDefaultCrossReference</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsCategory</name>
    <type>
      <types>CatalogRef.ProductsCategories</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsType</name>
    <type>
      <types>EnumRef.ProductsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ReplenishmentDeadline</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplenishmentMethod</name>
    <type>
      <types>EnumRef.InventoryReplenishmentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>ReportUOM</name>
    <type>
      <types>CatalogRef.UOMClassifier</types>
    </type>
  </attributes>
  <attributes>
    <name>SKU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Specification</name>
    <type>
      <types>CatalogRef.BillsOfMaterials</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeNorm</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseBatches</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseCharacteristics</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSerialNumbers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WriteOutTheGuaranteeCard</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShelfLife</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Subcontractor</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessGroup</name>
    <type>
      <types>CatalogRef.ProductAccessGroupsForExternalUsers</types>
    </type>
  </attributes>
  <attributes>
    <name>VisibleToExternalUsers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/AccumulationRegisters/GoodsAwaitingCustomsClearance/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
	 OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	GoodsAwaitingCustomsClearance.LineNumber AS LineNumber,
	|	GoodsAwaitingCustomsClearance.Company AS Company,
	|	GoodsAwaitingCustomsClearance.Counterparty AS Counterparty,
	|	GoodsAwaitingCustomsClearance.Contract AS Contract,
	|	GoodsAwaitingCustomsClearance.SupplierInvoice AS SupplierInvoice,
	|	GoodsAwaitingCustomsClearance.PurchaseOrder AS PurchaseOrder,
	|	GoodsAwaitingCustomsClearance.Products AS Products,
	|	GoodsAwaitingCustomsClearance.Characteristic AS Characteristic,
	|	GoodsAwaitingCustomsClearance.Batch AS Batch,
	|	GoodsAwaitingCustomsClearance.Quantity AS QuantityBeforeWrite,
	|	GoodsAwaitingCustomsClearance.Quantity AS QuantityChange,
	|	GoodsAwaitingCustomsClearance.Quantity AS QuantityOnWrite
	|INTO RegisterRecordsGoodsAwaitingCustomsClearanceChange
	|FROM
	|	AccumulationRegister.GoodsAwaitingCustomsClearance AS GoodsAwaitingCustomsClearance");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsGoodsAwaitingCustomsClearanceChange", False);
	
EndProcedure

Function BalancesControlQueryText() Export
	
	Return
	"SELECT ALLOWED
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange.LineNumber AS LineNumber,
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange.Company AS Company,
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange.Counterparty AS Counterparty,
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange.Contract AS Contract,
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange.SupplierInvoice AS SupplierInvoice,
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange.PurchaseOrder AS PurchaseOrder,
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange.Products AS Products,
	|	CatalogProducts.MeasurementUnit AS MeasurementUnit,
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange.Characteristic AS Characteristic,
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange.Batch AS Batch,
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange.QuantityChange + ISNULL(GoodsAwaitingCustomsClearanceBalances.QuantityBalance, 0) AS QuantityBalanceBeforeChange,
	|	ISNULL(GoodsAwaitingCustomsClearanceBalances.QuantityBalance, 0) AS QuantityBalance
	|FROM
	|	RegisterRecordsGoodsAwaitingCustomsClearanceChange AS RegisterRecordsGoodsAwaitingCustomsClearanceChange
	|		LEFT JOIN Catalog.Products AS CatalogProducts
	|		ON RegisterRecordsGoodsAwaitingCustomsClearanceChange.Products = CatalogProducts.Ref
	|		LEFT JOIN AccumulationRegister.GoodsAwaitingCustomsClearance.Balance(&ControlTime, ) AS GoodsAwaitingCustomsClearanceBalances
	|		ON RegisterRecordsGoodsAwaitingCustomsClearanceChange.Company = GoodsAwaitingCustomsClearanceBalances.Company
	|			AND RegisterRecordsGoodsAwaitingCustomsClearanceChange.Counterparty = GoodsAwaitingCustomsClearanceBalances.Counterparty
	|			AND RegisterRecordsGoodsAwaitingCustomsClearanceChange.Contract = GoodsAwaitingCustomsClearanceBalances.Contract
	|			AND RegisterRecordsGoodsAwaitingCustomsClearanceChange.SupplierInvoice = GoodsAwaitingCustomsClearanceBalances.SupplierInvoice
	|			AND RegisterRecordsGoodsAwaitingCustomsClearanceChange.PurchaseOrder = GoodsAwaitingCustomsClearanceBalances.PurchaseOrder
	|			AND RegisterRecordsGoodsAwaitingCustomsClearanceChange.Products = GoodsAwaitingCustomsClearanceBalances.Products
	|			AND RegisterRecordsGoodsAwaitingCustomsClearanceChange.Characteristic = GoodsAwaitingCustomsClearanceBalances.Characteristic
	|			AND RegisterRecordsGoodsAwaitingCustomsClearanceChange.Batch = GoodsAwaitingCustomsClearanceBalances.Batch
	|WHERE
	|	ISNULL(GoodsAwaitingCustomsClearanceBalances.QuantityBalance, 0) < 0
	|
	|ORDER BY
	|	LineNumber";
	
EndFunction

#EndRegion

#EndIf
